# Etape 1
* Importez les bibliothèques nécessaires

In [1]:
import pandas as pd

# Etape 2
* Étape 2. Créez les 3 DataFrames à partir des données brutes suivantes:

<p style="color:green"> 
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'prénom': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'nom de famille': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']} 
 <br> </br>
raw_data_2 = { 
        'subject_id': ['4', '5', '6', '7', '8'],
        'prénom': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
 <br> </br>
raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]} 
<\p>

In [2]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'prénom': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'nom de famille': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'prénom': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

# Etape 3
* Attribuez chacun à une variable appelée data1, data2, data3

In [3]:
data1=pd.DataFrame(raw_data_1)
data2=pd.DataFrame(raw_data_2)
data2.rename(columns={"last_name": "nom de famille"}, inplace=True)
data3=pd.DataFrame(raw_data_3)

<p style="font-size:28px ;text-align:center;color:red"> 
Par soucis de coherence [...],je rectifie la colonne last_name en "nom de famille"
</p>

In [4]:
data1

  subject_id  prénom nom de famille
0          1    Alex       Anderson
1          2     Amy       Ackerman
2          3   Allen            Ali
3          4   Alice           Aoni
4          5  Ayoung        Atiches

In [5]:
data2

  subject_id prénom nom de famille
0          4  Billy         Bonder
1          5  Brian          Black
2          6   Bran        Balwner
3          7  Bryce          Brice
4          8  Betty         Btisan

# Etape 4
* Joignez les deux dataframes le long de lignes et attribuez les à all_data

In [6]:
all_data = pd.concat([data1, data2],ignore_index=True) #ignore_index=True indexation continue entre data1 et data2

In [7]:
all_data

  subject_id  prénom nom de famille
0          1    Alex       Anderson
1          2     Amy       Ackerman
2          3   Allen            Ali
3          4   Alice           Aoni
4          5  Ayoung        Atiches
5          4   Billy         Bonder
6          5   Brian          Black
7          6    Bran        Balwner
8          7   Bryce          Brice
9          8   Betty         Btisan

# Etape 5
* Joignez les deux dataframes le long des colonnes et attribuez les à all_data_col

In [8]:
all_data_col = pd.concat([data1, data2], axis=1)

In [9]:
all_data_col

  subject_id  prénom nom de famille subject_id prénom nom de famille
0          1    Alex       Anderson          4  Billy         Bonder
1          2     Amy       Ackerman          5  Brian          Black
2          3   Allen            Ali          6   Bran        Balwner
3          4   Alice           Aoni          7  Bryce          Brice
4          5  Ayoung        Atiches          8  Betty         Btisan

# Etape 6
* Affichez les données data3

In [10]:
print(data3)

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

# Etape 7
* Fusionnez all_data et data3 avec la clef  subject_id

In [11]:
 res_fusion1= pd.merge(all_data, data3, on="subject_id")

In [12]:
res_fusion1

  subject_id  prénom nom de famille  test_id
0          1    Alex       Anderson       51
1          2     Amy       Ackerman       15
2          3   Allen            Ali       15
3          4   Alice           Aoni       61
4          4   Billy         Bonder       61
5          5  Ayoung        Atiches       16
6          5   Brian          Black       16
7          7   Bryce          Brice       14
8          8   Betty         Btisan       15

# Etape 8
* Fusionnez uniquement les données qui ont le même 'subject_id' sur data1 et data2

In [13]:
res_fusion2 = pd.merge(data1, data2, on="subject_id", how="inner")

In [14]:
res_fusion2

  subject_id prénom_x nom de famille_x prénom_y nom de famille_y
0          4    Alice             Aoni    Billy           Bonder
1          5   Ayoung          Atiches    Brian            Black

# Etape 9
* Fusionnez toutes les valeurs de data1 et data2, avec les enregistrements correspondants des deux côtés, le cas échéant.

In [15]:
res_fusion3=pd.merge(data1,data2,on="subject_id",how="outer")

In [16]:
res_fusion3

  subject_id prénom_x nom de famille_x prénom_y nom de famille_y
0          1     Alex         Anderson      NaN              NaN
1          2      Amy         Ackerman      NaN              NaN
2          3    Allen              Ali      NaN              NaN
3          4    Alice             Aoni    Billy           Bonder
4          5   Ayoung          Atiches    Brian            Black
5          6      NaN              NaN     Bran          Balwner
6          7      NaN              NaN    Bryce            Brice
7          8      NaN              NaN    Betty           Btisan

# Fin partie B de Pandas